namespace Data;

public class Interests
{
    public static string[] GetInterests()
    {
        return new[]
        {
            "Спорт 🏀",
            "Природа 🌿",
            "Искусство 🎨",
            "Музыка 🎵",
            "Путешествия ✈️",
            "Фотография 📷",
            "Кулинария 🍳",
            "Кино 🎥",
            "Литература 📚",
            "Наука 🔬",
            "Технологии 💻",
            "История 📜",
            "Психология 🧠",
            "Религия 🙏",
            "Мода 👗",
            "Вернуться в меню 🔙"
        };
    }

    /*private static readonly Dictionary<string, string> interestStickers = new Dictionary<string, string>
    {
        { "Спорт", "🏀" },
        { "Природа", "🌿" },
        { "Искусство", "🎨" },
        { "Музыка", "🎵" },
        { "Путешествия", "✈️" },
        { "Фотография", "📷" },
        { "Кулинария", "🍳" },
        { "Кино", "🎥" }, // Добавляем "Кино" и соответствующий стикер
        { "Литература", "📚" }, // Добавляем "Литература" и соответствующий стикер
        { "Наука", "🔬" }, // Добавляем "Наука" и соответствующий стикер
        { "Технологии", "💻" }, // Добавляем "Технологии" и соответствующий стикер
        { "История", "📜" }, // Добавляем "История" и соответствующий стикер
        { "Психология", "🧠" }, // Добавляем "Психология" и соответствующий стикер
        { "Религия", "🙏" },
        { "Мода", "👗" },
    };*/
}